Требуется реализовать на языке Python функцию Join(array, separator), которая принимает два параметра — список строк и разделитель — и возвращает строку, 
полученную соединением элементов переданного списка, при этом между элементами списка вставляется разделитель (separator). 
Если не передать функции разделитель, то она должна использовать в качестве разделителя пробел. Пример использования функции в примерах тестов.
В решении запрещено использовать стандартную функцию join.

def Join(array, separator = " "):
    _str = ""
    for i in range(len(array)):
        _str += str(array[i])
        if i<len(array)-1:
            _str+=separator
    return _str
