#Васин дом имеет в плане форму прямоугольника. Северная и южная стороны имеют длину по 
#A метров каждая, а западная и восточная — по B метров каждая.
#Вася прогуливается вокруг дома со скоростью 1 метр в секунду, 
начиная с угла между западной и южной стороной, и проходит вдоль южной, восточной, северной и западной сторон в указанном порядке. 
Обойдя полностью вокруг дома, Вася снова повторяет свой маршрут.
Требуется написать программу, которая определит, вдоль какой стены будет идти Вася через t секунд после начала прогулки. 
Будем считать, что дойдя то угла, Вася немедленно за него поворачивает, 
поэтому на секундах с нулевой по A−1-ю он находится у южной стены, на секунде номер 
A — у восточной, и так далее.


with open("input.txt","r") as f: 
    A, B, t = map(int, f.read().split())
with open("output.txt","w") as f:
    if t//(2*(A+B))>=1:
        S = t%(2*(A+B))
    else:
        S = t
    if S>=(2*A+B):
        _ch = 'W'
    elif S>=(A+B):
        _ch = 'N'
    elif S>=(A):
        _ch = 'E'
    else:
        _ch = 'S'
    f.write(_ch)
