Требуется написать программу, которая считывает имя и фамилию и выводит их в формате
Меня зовут [фамилия]
[имя] [фамилия]

_name=input()
_secname = input()
print("Меня зовут "+_secname+"\n"+_name+" "+_secname)
