Условный оператор — это просто! Верно?
Напишите программу, которая принимает на вход от пользователя одну строку. 
Если пользователь ответил "Просто!", "Easy!" или "Einfach!", напечатайте в ответ улыбающийся смайл ":)". В ином случае — грустный смайл ":(".

_otv = input()
if _otv == "Просто!" or _otv == "Easy!" or _otv=="Einfach!":
    print(":)")
else:
    print(":(")
