При написании сложных программ важное значение имеет стандартизация стиля кодирования, в частности формата записи имён переменных. 
Часто используются следующие два стандарта для имён переменных, состоящих из нескольких слов:
  1. Слова записываются друг за другом через знак подчёркивания с маленькой буквы (например my_variable).
  2. Слова записываются друг за другом подряд, при этом каждое слово начинается с большой буквы (например MyVariable).
Требуется написать программу, переводящую имя переменной из одного стандарта в другой.

with open ("input.txt", "r") as f:
    _str = f.read()
_newStr = _str[0].swapcase()
k=2
if _str.find('_') >0:
    k=1
for i in range(1,len(_str)):
    _str1 = ""
    if k ==1:
        if _str[i-1] == "_":
            _str1 =_str[i].upper()
        elif _str[i] != "_":
            _str1 = _str[i]
    else:
        if _str[i].isupper():
            _str1 = "_"+_str[i].lower()
        else:
            _str1 =_str[i].lower()
    _newStr +=_str1 
with open("output.txt", "w") as f:
    f.write(_newStr)
