Во входном файле записана строка текста, в которой могут встречаться:
  прописные и строчные (т.е. большие и маленькие) латинские буквы,
  пробелы,
  знаки препинания: точка, запятая, восклицательный и вопросительный знак,
  символ −, обозначающий в некоторых случаях тире, а в некоторых — дефис.
Слово — это последовательность подряд идущих латинских букв и знаков дефис, ограниченная с обоих концов. 
В качестве ограничителей могут выступать начало строки, конец строки, пробел, знак препинания, тире. 
Тире отличается от дефиса тем, что слева и справа от знака дефис пишутся буквы, а хотя бы с одной стороны от тире идет либо начало строки, либо конец строки, либо пробел, либо какой-либо знак препинания, либо еще одно тире.
Напишите программу, определяющую, сколько слов в данной строке текста.

with open("d.in", "r") as f:
    _str = f.read()
    
_arr = _str.split()

_arrNew =[]

for i in range(len(_arr)):
    if _arr[i].swapcase() != _arr[i]:
        _str = _arr[i]
        if _str[0] == '-':
            if _str[len(_str)-1] == '-':
                _str = _str[:len(_str)-1]
            _str = _str[1:]
        if _str[len(_str)-1] == '-':
            _str = _str[:len(_str)-1]
        
        if _arr[i].find("!") >0:
            _str1 =_arr[i].split("!")
            _str=" ".join(_str1)
            
        if _arr[i].find("?") >0:
            _str1 =_arr[i].split("?")
            _str=" ".join(_str1)
            
        if _arr[i].find(",") >0:
            _str1 =_arr[i].split(",")
            _str=" ".join(_str1)
            
        if _arr[i].find(".") >0:
            _str1 =_arr[i].split(".")
            _str=" ".join(_str1)
        _arrNew.append(_str)
        
_arrNew = (" ".join(_arrNew)).split()

with open("d.out", "w") as f:
    f.write(str(len(_arrNew)))
