Во входном файле записана строка текста, в которой могут встречаться:

  прописные и строчные (т.е. большие и маленькие) латинские буквы,
  пробелы,
  знаки препинания: точка, запятая, восклицательный и вопросительный знак.
Слово — это последовательность подряд идущих латинских букв. Вопреки правилам, все знаки препинания в этой задаче окружены пробелами.
Напишите программу, определяющую, сколько слов в данной строке текста.

_arr = input().split()
_arrNew =[]
for i in range(len(_arr)):
    if _arr[i].swapcase() != _arr[i]:
        _arrNew.append(_arr[i])
        
print(len(_arrNew))
