Вывести сначала все публичные атрибуты класса str в алфавитном порядке, а затем все приватные атрибуты, тоже в алфавитном порядке, каждый с новой строки.

Названия приватных методов начинаются с символа '_' (ascii 95).

s = dir(str)
print("\n".join([s[i] for i in range(len(s)) if not("__") in s[i]]))
print("\n".join([s[i] for i in range(len(s)) if "__" in s[i]]))
