#Требуется написать программу, которая печатает все цвета радуги на русском языке. Каждый цвет вывести в отдельной строке с большой буквы.
print("Красный\nОранжевый\nЖелтый\nЗеленый\nГолубой\nСиний\nФиолетовый")
