Дан вектор произвольной размерности. Необходимо посчитать так называемую норму L1 для этого вектора. 
Норма L1 — это сумма абсолютных величин компонент вектора (абсолютная величина вычисляется функцией abs).

print(sum(map(lambda x: abs(int(x)),input().split()),0))
