Требуется написать программу, которая выведет квадраты положительных элементов списка в обратном порядке. 
Решение должно быть написано в одну строку (в данном случае одной строкой считается одно выражение в понятии языка питон).

print(" ".join([str(int(x) ** 2) for x in reversed(input().split()) if int(x)>0]))
