Необходимо составить новый список из существующего по такому правилу: крайние элементы в начале и в конце списка оставить на своих местах (по два элемента с каждой стороны), а элементы между ними записать в обратном порядке. 
 Решение должно быть написано в две строки (в данном случае одной строкой считается одно выражение в понятии языка питон).
_arr = input().split()
print(" ".join([ _arr[i] if i ==0 or i ==1 or i == len(_arr)-1 or i == len(_arr)-2
                         else _arr[len(_arr)-1-i] 
                         for i in range(len(_arr))]))
  
